# Question 1 - Create a DataFrame

In [2]:
# Create the following dataframe with random values
# np.random.seed(101) -> for getting same random values as mine

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [262]:
import pandas as pd
import random 
import numpy as np

np.random.seed(101)
a = pd.DataFrame(np.random.randn(5,4),index=['A','B','C','D','E'],columns=['W','X','Y','Z'])
a

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

## Selection and Indexing

Let's learn the various methods to grab data from a DataFrame

In [85]:
# Get the 'W' column

In [86]:
a['W']    #this is the solution

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [83]:
a[1:]   # this works

          W         X         Y         Z  new
B  0.651118 -0.319318 -0.848077  0.605965  NaN
C -2.018168  0.740122  0.528813 -0.589001  NaN
D  0.188695 -0.758872 -0.933237  0.955057  NaN
E  0.190794  1.978757  2.605967  0.683509  NaN

In [87]:
a[:2][:2]    # this works as well but not in the way i would expect 
             # behaviour is actully strange - would like to discuss this

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965

In [88]:
a.iloc[:,0]  # this is an alternate solution

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [89]:
# Get columns by passing a list of column names

In [90]:
b = a.loc[:,('W','Z')]    # this works
b

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

In [91]:
b[['W','Z']]     # this works as well

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

In [98]:
a.iloc[:,[0,3]]   #this is using iloc

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

**Creating a new column:**

In [74]:
# Create a 'new' column by adding values of 'W' and 'Y'

In [265]:
# c = pd.DataFrame(np.random.randn(5,1))   >>> I thought this would work - but no

c = a['W'] + a['Y']
a['new'] = c
a

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [266]:
a2 = a.assign(A = [1,2,3,4,5])
a2

          W         X         Y         Z       new  A
A  2.706850  0.628133  0.907969  0.503826  3.614819  1
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959  2
C -2.018168  0.740122  0.528813 -0.589001 -1.489355  3
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542  4
E  0.190794  1.978757  2.605967  0.683509  2.796762  5

In [107]:
df

NameError: name 'df' is not defined

*** Removing Columns***

In [11]:
# Drop the 'new' column

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [116]:
del a['new']
a

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [ ]:
a.drop('new', 1)      #this works as well

In [15]:
# Drop the row 'E' keeping inplace=False

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [117]:
a.drop('E',0)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

** Selecting Rows**

In [16]:
# Using loc, get the following results

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

In [123]:
a.loc['A']

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

Or select based off of position instead of label

In [17]:
# Using iloc, get the following results

W   -2.018168
X    0.740122
Y    0.528813
Z   -0.589001
Name: C, dtype: float64

In [124]:
a.iloc[1]

W    0.651118
X   -0.319318
Y   -0.848077
Z    0.605965
Name: B, dtype: float64

** Selecting subset of rows and columns **

In [18]:
# Using loc, get the following results

-0.8480769834036315

In [126]:
a.loc['B','Y']

-0.8480769834036315

In [19]:
# Using loc, get the following results

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077

In [128]:
a.loc[['A','B'],['W','Y']]

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077

### Conditional Selection

An important feature of pandas is conditional selection using bracket notation, very similar to numpy:

In [20]:
# Print df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [176]:
np.random.seed(101)
a = pd.DataFrame(np.random.randn(5,4),index=['A','B','C','D','E'],columns=['W','X','Y','Z'])
a

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [21]:
# Check which values are greater than zero

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [177]:
#This does not work, not sure why - just syntax ([] because i used lists)
#b = a.loc[a['W'] < 0, a['W']] = 'False'
#b = a.loc[a['W'] >= 0, a['W']] = 'True'
#print(b)

#This does not work as the 2nd condition has a str issue
#a[a>0] = 'True'  
#a[a<0] = 'False' 
#a

#This does not work as the 2nd condition has a str issue
#a.loc[(a.W > 0),'W']='True'
#a.loc[(a.W < 0),'W']='False'
#a

#I looked at the solution, it is nice but disturbing - would never thought that would be the solution

a>0

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [22]:
# Get the values which are greater than zero

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [172]:
np.random.seed(101)
a = pd.DataFrame(np.random.randn(5,4),index=['A','B','C','D','E'],columns=['W','X','Y','Z'])

a[a<0] = 'NaN'
a

          W         X         Y         Z
A   2.70685  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794   1.97876   2.60597  0.683509

In [23]:
# Get the values of W where values of W are greater than zero

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [178]:
np.random.seed(101)
a = pd.DataFrame(np.random.randn(5,4),index=['A','B','C','D','E'],columns=['W','X','Y','Z'])

a[a['W']>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [24]:
# Get the values of 'Y' where values of W are greater than zero

A    0.907969
B   -0.848077
D   -0.933237
E    2.605967
Name: Y, dtype: float64

In [184]:
np.random.seed(101)
a = pd.DataFrame(np.random.randn(5,4),index=['A','B','C','D','E'],columns=['W','X','Y','Z'])

a[a['W']>0]['Y']
# I had to look at the solution

A    0.907969
B   -0.848077
D   -0.933237
E    2.605967
Name: Y, dtype: float64

In [25]:
# Get the values of 'Y' and 'X' where values of W are greater than zero

          Y         X
A  0.907969  0.628133
B -0.848077 -0.319318
D -0.933237 -0.758872
E  2.605967  1.978757

In [186]:
a[a['W']>0][['Y','X']]

          Y         X
A  0.907969  0.628133
B -0.848077 -0.319318
D -0.933237 -0.758872
E  2.605967  1.978757

For two conditions you can use | and & with parenthesis:

In [26]:
# Get the values of dataframe where values of W are greater than zero and values of Y are greater than 1

          W         X         Y         Z
E  0.190794  1.978757  2.605967  0.683509

In [194]:
a[(a['W']>0)  &  (a['Y']>1) ]

          W         X         Y         Z
E  0.190794  1.978757  2.605967  0.683509

## More Index Details

Let's discuss some more features of indexing, including resetting the index or setting it something else. We'll also talk about index hierarchy!

In [198]:
np.random.seed(101)
a = pd.DataFrame(np.random.randn(5,4),index=['A','B','C','D','E'],columns=['W','X','Y','Z'])

In [28]:
# Reset to default 0,1...n index

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [199]:
a.reset_index()

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [29]:
# Re-assigning indices

In [31]:
# Create the following dataframe

          W         X         Y         Z States
A  2.706850  0.628133  0.907969  0.503826     CA
B  0.651118 -0.319318 -0.848077  0.605965     NY
C -2.018168  0.740122  0.528813 -0.589001     WY
D  0.188695 -0.758872 -0.933237  0.955057     OR
E  0.190794  1.978757  2.605967  0.683509     CO

In [205]:
b = ['CA','NY','WY','OR','CO']
a['States']=b
a

          W         X         Y         Z States
A  2.706850  0.628133  0.907969  0.503826     CA
B  0.651118 -0.319318 -0.848077  0.605965     NY
C -2.018168  0.740122  0.528813 -0.589001     WY
D  0.188695 -0.758872 -0.933237  0.955057     OR
E  0.190794  1.978757  2.605967  0.683509     CO

In [32]:
# Set 'States' as indices

               W         X         Y         Z
States
CA      2.706850  0.628133  0.907969  0.503826
NY      0.651118 -0.319318 -0.848077  0.605965
WY     -2.018168  0.740122  0.528813 -0.589001
OR      0.188695 -0.758872 -0.933237  0.955057
CO      0.190794  1.978757  2.605967  0.683509

In [206]:
a.index = b
a

           W         X         Y         Z States
CA  2.706850  0.628133  0.907969  0.503826     CA
NY  0.651118 -0.319318 -0.848077  0.605965     NY
WY -2.018168  0.740122  0.528813 -0.589001     WY
OR  0.188695 -0.758872 -0.933237  0.955057     OR
CO  0.190794  1.978757  2.605967  0.683509     CO

In [207]:
a.set_index('States')

               W         X         Y         Z
States
CA      2.706850  0.628133  0.907969  0.503826
NY      0.651118 -0.319318 -0.848077  0.605965
WY     -2.018168  0.740122  0.528813 -0.589001
OR      0.188695 -0.758872 -0.933237  0.955057
CO      0.190794  1.978757  2.605967  0.683509

## Multi-Index and Index Hierarchy

Let us go over how to work with Multi-Index, first we'll create a quick example of what a Multi-Indexed DataFrame would look like:

In [209]:
# Index Levels - A basic example
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [210]:
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [38]:
# Using the above hier_index variable, create the following DataFrame

             A         B
G1 1  0.302665  1.693723
   2 -1.706086 -1.159119
   3 -0.134841  0.390528
G2 1  0.166905  0.184502
   2  0.807706  0.072960
   3  0.638787  0.329646

In [212]:
a = pd.DataFrame(np.random.randn(6,2),index = hier_index,columns=['A','B'])
a

             A         B
G1 1 -0.497104 -0.754070
   2 -0.943406  0.484752
   3 -0.116773  1.901755
G2 1  0.238127  1.996652
   2 -0.993263  0.196800
   3 -1.136645  0.000366

Now let's show how to index this! For index hierarchy we use df.loc[], if this was on the columns axis, you would just use normal bracket notation df[]. Calling one level of the index returns the sub-dataframe:

In [39]:
# Get the values of G1

          A         B
1  0.302665  1.693723
2 -1.706086 -1.159119
3 -0.134841  0.390528

In [214]:
a.loc['G1']

          A         B
1 -0.497104 -0.754070
2 -0.943406  0.484752
3 -0.116773  1.901755

In [40]:
# Get the following results

A    0.302665
B    1.693723
Name: 1, dtype: float64

In [227]:
a.loc['G1'].loc[1]

A   -0.497104
B   -0.754070
Name: 1, dtype: float64

In [42]:
# Give the indices names/labels

In [43]:
df

                  A         B
Group Num
G1    1    0.302665  1.693723
      2   -1.706086 -1.159119
      3   -0.134841  0.390528
G2    1    0.166905  0.184502
      2    0.807706  0.072960
      3    0.638787  0.329646

In [233]:
# hier_index.set_names('Group', level =1, inplace = False)  #this did not work

a.index.names = ['Group','Num']
a

                  A         B
Group Num
G1    1   -0.497104 -0.754070
      2   -0.943406  0.484752
      3   -0.116773  1.901755
G2    1    0.238127  1.996652
      2   -0.993263  0.196800
      3   -1.136645  0.000366

In [44]:
# Using 'df.xs', get the following results

            A         B
Num
1    0.302665  1.693723
2   -1.706086 -1.159119
3   -0.134841  0.390528

In [234]:
a.xs('G1')

            A         B
Num
1   -0.497104 -0.754070
2   -0.943406  0.484752
3   -0.116773  1.901755

In [45]:
# Using 'df.xs', get the following results

A    0.302665
B    1.693723
Name: (G1, 1), dtype: float64

In [235]:
a.xs('G1').xs(1)

A   -0.497104
B   -0.754070
Name: 1, dtype: float64

In [46]:
# Using 'df.xs', get the following results

              A         B
Group
G1     0.302665  1.693723
G2     0.166905  0.184502

In [239]:
# a.xs(('G1','G2')).xs(1)   this does not work

# Missing Data

In [6]:
# Create the following DataFrame

In [5]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [252]:
a = pd.DataFrame([[1.0,5.0,1],[2,np.NaN,2],[np.NaN,np.NaN,3]], columns = ['A','B','C'])
a

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [7]:
# Drop null values - keeping inplace=False

     A    B  C
0  1.0  5.0  1

In [254]:
a.dropna(inplace = True)
a

     A    B  C
0  1.0  5.0  1

In [268]:
a = pd.DataFrame([[1.0,5.0,1],[2,np.NaN,2],[np.NaN,np.NaN,3]], columns = ['A','B','C'])

a.dropna()

     A    B  C
0  1.0  5.0  1

In [8]:
# Drop the columns that contain null values

   C
0  1
1  2
2  3

In [269]:
a.dropna(axis=1)

   C
0  1
1  2
2  3

In [9]:
# Drop null values, setting a threshold - 2 in this case

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [271]:
a.dropna(thresh = 2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [10]:
# Fill values

            A           B  C
0           1           5  1
1           2  FILL VALUE  2
2  FILL VALUE  FILL VALUE  3

In [272]:
a.replace(np.NaN,'FILL')

      A     B  C
0     1     5  1
1     2  FILL  2
2  FILL  FILL  3

In [13]:
# Fill values with zeros

     A    B  C
0  1.0  5.0  1
1  2.0  0.0  2
2  0.0  0.0  3

In [276]:
a = pd.DataFrame([[1.0,5.0,1],[2,np.NaN,2],[np.NaN,np.NaN,3]], columns = ['A','B','C'])

a.replace(np.NaN,float(0))

     A    B  C
0  1.0  5.0  1
1  2.0  0.0  2
2  0.0  0.0  3

In [11]:
# Fill values of A, with the mean of column A

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [277]:
a = pd.DataFrame([[1.0,5.0,1],[2,np.NaN,2],[np.NaN,np.NaN,3]], columns = ['A','B','C'])

a['A'].replace(np.NaN,a['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [12]:
# Fill values of dataframe, with the mean of dataframe

     A    B  C
0  1.0  5.0  1
1  2.0  5.0  2
2  1.5  5.0  3

In [278]:
a = pd.DataFrame([[1.0,5.0,1],[2,np.NaN,2],[np.NaN,np.NaN,3]], columns = ['A','B','C'])

a.replace(np.NaN,a.mean())

     A    B  C
0  1.0  5.0  1
1  2.0  5.0  2
2  1.5  5.0  3

## Good luck